# Machine Learning Tutorial Python - 14: Naive Bayes Classifier Algorithm Part 1

In [27]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [28]:
df.shape

(891, 12)

In [29]:
df.drop(['PassengerId','Name','Ticket','SibSp','Parch','Cabin','Embarked'],axis=1,inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [30]:
Survived = df.Survived

In [31]:
inputs = df.drop('Survived',axis=1)

In [32]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [33]:
inputs = pd.concat([inputs,dummies],axis=1)
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [34]:
inputs.drop('Sex',axis=1,inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [35]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [36]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [37]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [38]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [39]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,Survived,test_size=.2)

In [40]:
X_train

     Pclass        Age      Fare  female  male
581       1  39.000000  110.8833       1     0
736       3  48.000000   34.3750       1     0
387       2  36.000000   13.0000       1     0
15        2  55.000000   16.0000       1     0
230       1  35.000000   83.4750       1     0
..      ...        ...       ...     ...   ...
611       3  29.699118    7.0500       0     1
772       2  57.000000   10.5000       1     0
844       3  17.000000    8.6625       0     1
55        1  29.699118   35.5000       0     1
89        3  24.000000    8.0500       0     1

[712 rows x 5 columns]

In [41]:
len(X_train),len(X_test)

(712, 179)

In [42]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [43]:
model.fit(X_train,y_train)

GaussianNB()

In [44]:
model.score(X_test,y_test)

0.770949720670391

The Score of the mdoel may varry based on the sample

In [45]:
X_test[:10]

     Pclass        Age      Fare  female  male
545       1  64.000000   26.0000       0     1
587       1  60.000000   79.2000       0     1
802       1  11.000000  120.0000       0     1
285       3  33.000000    8.6625       0     1
289       3  22.000000    7.7500       1     0
824       3   2.000000   39.6875       0     1
201       3  29.699118   69.5500       0     1
515       1  47.000000   34.0208       0     1
637       2  31.000000   26.2500       0     1
420       3  29.699118    7.8958       0     1

In [46]:
y_test[:10]

545    0
587    1
802    1
285    0
289    1
824    0
201    0
515    0
637    0
420    0
Name: Survived, dtype: int64

In [47]:
model.predict(X_test[:10])

array([0, 0, 1, 0, 1, 0, 0, 0, 0, 0], dtype=int64)

In [48]:
model.predict_proba(X_test[:10])

array([[0.90567345, 0.09432655],
       [0.70617944, 0.29382056],
       [0.12663069, 0.87336931],
       [0.9908967 , 0.0091033 ],
       [0.03627217, 0.96372783],
       [0.97526366, 0.02473634],
       [0.97231883, 0.02768117],
       [0.91987592, 0.08012408],
       [0.97847397, 0.02152603],
       [0.99055024, 0.00944976]])